Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: This method is called when an iterator is required for a container. This method should return a new iterator object that can iterate over all the objects in the container. For mappings, it should iterate over the keys of the container, and should also be made available as the method :meth:`keys`.
ru: Этот метод у данного объекта-контейнера вызывается, когда нужен итератор для данного объекта. Этот метод должен возвращать новый объект-итератор, который будет перебирать все объекты в этом объекте-контейнере. Для отображений он должен перебирать ключи, и также должен быть доступен в качестве метода «:meth:`keys`» .

source: Iterator objects also need to implement this method; they are required to return themselves. For more information on iterator objects, see :ref:`typeiter`.
ru: Сами объекты-итераторы тоже должны реализовывать этот метод – для того, чтобы возвращать самих себя. Дополнительную информацию об объектах-итераторах смотрите в «Итерируемые типы» :ref:`typeiter` .

source: Called (if present) by the :func:`reversed` built-in to implement reverse iteration. It should return a new iterator object that iterates over all the objects in the container in reverse order.
ru: Вызывается (если имеется) встроенной функцией «:func:`reversed`» для реализации перебора в обратном порядке. Этот метод должен возвращать новый объект-итератор, который будет перебирать в обратном порядке все объекты в данном объекте-контейнере.

source: If the :meth:`__reversed__` method is not provided, the :func:`reversed` built-in will fall back to using the sequence protocol (:meth:`__len__` and :meth:`__getitem__`). Objects that support the sequence protocol should only provide :meth:`__reversed__` if they can provide an implementation that is more efficient than the one provided by :func:`reversed`.
ru: Если метод «:meth:`__reversed__`» не предоставлен, то встроенная функция «:func:`reversed`» будет использовать рассматриваемый в данном параграфе протокол последовательностей (а именно : «:meth:`__len__`» и «:meth:`__getitem__`» ) . Объекты, поддерживающие данный протокол должны предоставлять «:meth:`__reversed__`» , только если они могут обеспечить более эффективную реализацию, чем предлагает «:func:`reversed`» .

source: The membership test operators (:keyword:`in` and :keyword:`not in`) are normally implemented as an iteration through a sequence. However, container objects can supply the following special method with a more efficient implementation, which also does not require the object be a sequence.
ru: Операторы проверки вхождения ( «:keyword:`in`» и «:keyword:`not in`» ) обычно реализуются через перебор последовательности. Однако, контейнерные объекты могут предоставлять перечисленные ниже специальные методы с более эффективной реализацией, при этом не обязательно, чтобы объекты были последовательностями.

source: Called to implement membership test operators. Should return true if *item* is in *self*, false otherwise. For mapping objects, this should consider the keys of the mapping rather than the values or the key-item pairs.
ru: Вызывается для реализации операторов проверки членства. Должен возвращать «:const:`True`» , если *item* находится в *self* , иначе – «:const:`False`» . Для объектов-отображений при этом подразумеваются ключи, а не значения или пары ключ–значение.

source: For objects that don't define :meth:`__contains__`, the membership test first tries iteration via :meth:`__iter__`, then the old sequence iteration protocol via :meth:`__getitem__`, see :ref:`this section in the language reference <membership-test-details>`.
ru: Для объектов, в которых не определён «__contains__()» , проверка членства сначала пытается перебирать с помощью «__iter__()» , затем используя устаревший подход – с помощью «__getitem__()» ( подробнее в :ref:`соответствующем разделе <membership-test-details>` ) .

source: Emulating numeric types
ru: Эмулирование числовых типов

source: The following methods can be defined to emulate numeric objects. Methods corresponding to operations that are not supported by the particular kind of number implemented (e.g., bitwise operations for non-integral numbers) should be left undefined.
ru: Следующие методы могут быть определены для эмулирования числовых объектов. Методы, соответствующие операциям, не поддерживаемым данным конкретным видом реализуемого числа (например, побитовые операции для не целых чисел) – не следует определять.

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``). For instance, to evaluate the expression ``x + y``, where *x* is an instance of a class that has an :meth:`__add__` method, ``x.__add__(y)`` is called. The :meth:`__divmod__` method should be the equivalent to using :meth:`__floordiv__` and :meth:`__mod__`; it should not be related to :meth:`__truediv__`. Note that :meth:`__pow__` should be defined to accept an optional third argument if the ternary version of the built-in :func:`pow` function is to be supported.
ru: Данные методы вызываются для реализации двухоперандных операций ( «``+``», «``-``», «``*``», «``/``», «``//``», «``%``», «:func:`divmod`», «:func:`pow`», «``**``», «``<<``», «``>>``», «``&``», «``^``», «``|``» ) . Например, для вычисления выражения ``x + y`` , где *x* является экземпляром класса, имеющего метод «:meth:`__add__`» – вызывается метод «``x.__add__(y)``» . Метод «:meth:`__divmod__`» должен быть эквивалентным использованию методов «:meth:`__floordiv__`» и «:meth:`__mod__`» , но он не должен соответствовать «:meth:`__truediv__`» . Заметьте, что «:meth:`__pow__`» должен быть определён принимающим необязательный третий аргумент, если должна поддерживаться трёхоперандная версия встроенной функции «:func:`pow`» .

source: If one of those methods does not support the operation with the supplied arguments, it should return ``NotImplemented``.
ru: Если какой-либо из указанных выше методов не поддерживает операцию над предоставленными аргументами – он должен вернуть значение «``NotImplemented``» .

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``) with reflected (swapped) operands. These functions are only called if the left operand does not support the corresponding operation and the operands are of different types. [#]_ For instance, to evaluate the expression ``x - y``, where *y* is an instance of a class that has an :meth:`__rsub__` method, ``y.__rsub__(x)`` is called if ``x.__sub__(y)`` returns *NotImplemented*.
ru: Данные методы вызываются для реализации двухоперандных операций ( «``+``», «``-``», «``*``», «``/``», «``//``», «``%``», «:func:`divmod`», «:func:`pow`», «``**``», «``<<``», «``>>``», «``&``», «``^``», «``|``» ) с обратным порядком операндов . Эти функции вызываются, только если первый (левый) операнд не поддерживает соответствующую операцию, а операнды разных типов. [#]_ (Для операндов одинакового типа – подразумевается, что если метод для “прямого” порядка (например, «:meth:`__add__()`» ) непримени́м, то данная операция вообще не поддерживается – поэтому “обратная” операция и не вызывается. ) Например : при вычислении выражения ``x - y`` , где *y* является экземпляром класса, имеющего метод «:meth:`__rsub__`» – вызывается «``y.__rsub__(x)``» , если «``x.__sub__(y)``» возвращает значение «``NotImplemented``» .

source: Note that ternary :func:`pow` will not try calling :meth:`__rpow__` (the coercion rules would become too complicated).
ru: Заметьте, что трёхоперандное «:func:`pow`» не будет пытаться вызвать «:meth:`__rpow__`» (соответствующие правила приведения (перехода) были бы слишком сложны) .

source: If the right operand's type is a subclass of the left operand's type and that subclass provides the reflected method for the operation, this method will be called before the left operand's non-reflected method. This behavior allows subclasses to override their ancestors' operations.
ru: Если тип правого операнда является подклассом класса левого операнда, и этот подкласс предоставляет для той же операции метод с обратным порядком операндов, то этот метод будет вызван до метода с прямым порядком у левого операнда. Такое поведение позволяет подклассам переопределять операции их предков.

source: These methods are called to implement the augmented arithmetic assignments (``+=``, ``-=``, ``*=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). These methods should attempt to do the operation in-place (modifying *self*) and return the result (which could be, but does not have to be, *self*). If a specific method is not defined, the augmented assignment falls back to the normal methods. For instance, to execute the statement ``x += y``, where *x* is an instance of a class that has an :meth:`__iadd__` method, ``x.__iadd__(y)`` is called. If *x* is an instance of a class that does not define a :meth:`__iadd__` method, ``x.__add__(y)`` and ``y.__radd__(x)`` are considered, as with the evaluation of ``x + y``.
ru: Данные методы вызываются для реализации расширеных арифметических операций-назначений ( «``+=``», «``-=``», «``*=``», «``/=``», «``//=``», «``%=``», «``**=``», «``<<=``», «``>>=``», «``&=``», «``^=``», «``|=``» ) . Эти методы должны пытаться выполнять операции “на месте” (изменяя *self*) и возвращать результат (который может, но не обязан быть *self* ) . Если специальный метод не определён, то операция использует обычные арифметические методы. Например, для вычисления выражения ``x += y`` , где *x* является экземпляром класса, имеющего метод «:meth:`__iadd__`» – вызывается «``x.__iadd__(y)``» . Если *x* является экземпляром класса, в котором не определён метод «:meth:`__iadd__`» , то используются «``x.__add__(y)``» и «``y.__radd__(x)``» – как для вычисления ``x + y`` .

source: Called to implement the unary arithmetic operations (``-``, ``+``, :func:`abs` and ``~``).
ru: Данные методы вызываются для реализации однооперандных арифметических операций ( «``-``», «``+``», «:func:`abs`» и «``~``» ) .

source: Called to implement the built-in functions :func:`complex`, :func:`int`, :func:`float` and :func:`round`. Should return a value of the appropriate type.
ru: Данные методы вызываются для реализации встроенных функций «:func:`complex`», «:func:`int`», «:func:`float`» и «:func:`round`» . Должны возвращать значение соответствующего типа.

source: Called to implement :func:`operator.index`. Also called whenever Python needs an integer object (such as in slicing, or in the built-in :func:`bin`, :func:`hex` and :func:`oct` functions). Must return an integer.
ru: Данный метод вызывается для реализации функции «:func:`operator.index`» . Также вызывается, когда Питону требуется целочисленный объект (например в срезах; или во встроенных функциях : «:func:`bin`», «:func:`hex`» и «:func:`oct`» ) . Должен возвращать целое число.

source: With Statement Context Managers
ru: :dfn:`“Менеджеры контекста”<context manager>` для инструкции «:keyword:`with`»

source: A :dfn:`context manager` is an object that defines the runtime context to be established when executing a :keyword:`with` statement. The context manager handles the entry into, and the exit from, the desired runtime context for the execution of the block of code. Context managers are normally invoked using the :keyword:`with` statement (described in section :ref:`with`), but can also be used by directly invoking their methods.
ru: :dfn:`“Менеджер контекста”<context manager>` – это объект, который задаёт контекст, который должен быть установлен при исполнении инструкции «:keyword:`with`» . Такой менеджер контекста управляет входом, выходом, требуемым контекстом исполнения данного блока кода. Менеджеры контекста обычно вызываются через инструкцию «:keyword:`with`» (описание в разделе “Инструкция «:keyword:`with`»” :ref:`with` ) , но также могут использоваться через явный вызов их методов.

source: Typical uses of context managers include saving and restoring various kinds of global state, locking and unlocking resources, closing opened files, etc.
ru: Характерное применение менеджеров контекста включает : сохранение и восстановление глобального состояния, блокирование и разблокирование ресурсов, закрытие открытых файлов, и т.д. .

source: For more information on context managers, see :ref:`typecontextmanager`.
ru: Дополнительную информацию смотрите в разделе :ref:`“Типы менеджеров контекста”<typecontextmanager>` .

source: Enter the runtime context related to this object. The :keyword:`with` statement will bind this method's return value to the target(s) specified in the :keyword:`as` clause of the statement, if any.
ru: Входит в оперативный (существующий на стадии исполнения) контекст, относящийся к данному объекту. Инструкция «:keyword:`with`» будет назначать (связывать) возвращаемое значение этого метода целям (именам) заявленным в ветви «:keyword:`as`» , если таковая имеется.

source: Exit the runtime context related to this object. The parameters describe the exception that caused the context to be exited. If the context was exited without an exception, all three arguments will be :const:`None`.
ru: Выходит из оперативного (существующего на стадии исполнения) контекста, относящегося к данному объекту. Указанные параметры определяют, какое именно исключение привело к выходу из данного контекста. Если выход из данного контекста происходит без исключения, то все три аргумента будут «:const:`None`» .

source: If an exception is supplied, and the method wishes to suppress the exception (i.e., prevent it from being propagated), it should return a true value. Otherwise, the exception will be processed normally upon exit from this method.
ru: Если дано исключение и данный метод собирается “подавить” это исключение (тоесть, не пропустить его дальше) , то он должен вернуть значение, эквивалентное «:const:`True`» . Иначе : по выходу из этого метода будет продолжена нормальная обработка данного исключения.

source: Note that :meth:`__exit__` methods should not reraise the passed-in exception; this is the caller's responsibility.
ru: Заметьте, что методы «:meth:`__exit__`» не должны перевызывать переданные внутрь них исключения – это обязанность вызвавшего кода.

source: Special method lookup
ru: Обращение к специальным методам

source: For custom classes, implicit invocations of special methods are only guaranteed to work correctly if defined on an object's type, not in the object's instance dictionary. That behaviour is the reason why the following code raises an exception::
ru: Для определяемых пользователем классов, работа явных вызовов специальных методов гарантирована, только если эти методы определены в словаре класса данного объекта, а не экземпляра. Такое поведение приводит к тому, что следующий код приводит к исключению : ::

source: The rationale behind this behaviour lies with a number of special methods such as :meth:`__hash__` and :meth:`__repr__` that are implemented by all objects, including type objects. If the implicit lookup of these methods used the conventional lookup process, they would fail when invoked on the type object itself::
ru: Смысл в таком поведении заключается в том, что некоторые специальные методы, такие как «:meth:`__hash__`» и «:meth:`__repr__`» , реализованы во всех объектах, включая и объекты-типы. Если бы явное обращение к этим методам использовало стандартный процесс обращения, то они бы вызывали ошибку при применении к самому объекту-классу : ::

source: Incorrectly attempting to invoke an unbound method of a class in this way is sometimes referred to as 'metaclass confusion', and is avoided by bypassing the instance when looking up special methods::
ru: Неправильные попытки вызвать таким способом несвязанный метод класса иногда называют “путаница метаклассов” и справляются с этим, пропуская (обходя) экземпляр при доступе к специальным методам : ::

source: In addition to bypassing any instance attributes in the interest of correctness, implicit special method lookup generally also bypasses the :meth:`__getattribute__` method even of the object's metaclass::
ru: В дополнение к пропуску любых атрибутов экземпляров с целью сохранения корректности – явный поиск специального метода, в общем случае, также пропускает метод «:meth:`__getattribute__`» даже в метаклассе данного объекта : ::

source: >>> class Meta(type): ... def __getattribute__(*args): ... print("Metaclass getattribute invoked") ... return type.__getattribute__(*args) ... >>> class C(object, metaclass=Meta): ... def __len__(self): ... return 10 ... def __getattribute__(*args): ... print("Class getattribute invoked") ... return object.__getattribute__(*args) ... >>> c = C() >>> c.__len__() # Explicit lookup via instance Class getattribute invoked 10 >>> type(c).__len__(c) # Explicit lookup via type Metaclass getattribute invoked 10 >>> len(c) # Implicit lookup 10
ru: >>> class Meta(type): ... def __getattribute__(*args): ... print("Metaclass getattribute invoked") ... return type.__getattribute__(*args) ... >>> class C(object, metaclass=Meta): ... def __len__(self): ... return 10 ... def __getattribute__(*args): ... print("Class getattribute invoked") ... return object.__getattribute__(*args) ... >>> c = C() >>> c.__len__() # Явный поиск через экземпляр Class getattribute invoked 10 >>> type(c).__len__(c) # Явный поиск через класс Metaclass getattribute invoked 10 >>> len(c) # Косвенный поиск 10

source: Bypassing the :meth:`__getattribute__` machinery in this fashion provides significant scope for speed optimisations within the interpreter, at the cost of some flexibility in the handling of special methods (the special method *must* be set on the class object itself in order to be consistently invoked by the interpreter).
ru: Пропуск (обход) механизма «:meth:`__getattribute__`» в такой манере даёт значительное ограничение ради оптимизации по скорости в интерпретаторе, незначительно жертвуя удобством в обращении со специальными методами (специальный метод должен быть установлен в самом объекте-классе для того, чтобы быть нормально вызванным интерпретатором) .

source: It *is* possible in some cases to change an object's type, under certain controlled conditions. It generally isn't a good idea though, since it can lead to some very strange behaviour if it is handled incorrectly.
ru: В некоторых случаях, при выполнении определённых условий, *возможно таки* изменить тип объекта. В общем случае – это плохая практика, поскольку это может приводить к некоторым очень странным результатам при неосторожном обращении.

source: Execution model
ru: Модель исполнения

source: Naming and binding
ru: Именование и связывание

source: :dfn:`Names` refer to objects. Names are introduced by name binding operations. Each occurrence of a name in the program text refers to the :dfn:`binding` of that name established in the innermost function block containing the use.
ru: :dfn:`Имена` указывают на обьекты. Имена вводятся операцииями :dfn:`связывания` (назначения) имён. Каждое появление имени в тексте программы указывает на то, что назначено этому имени в данном самом внутреннем функциональном блоке.

source: A :dfn:`block` is a piece of Python program text that is executed as a unit. The following are blocks: a module, a function body, and a class definition. Each command typed interactively is a block. A script file (a file given as standard input to the interpreter or specified on the interpreter command line the first argument) is a code block. A script command (a command specified on the interpreter command line with the '**-c**' option) is a code block. The string argument passed to the built-in functions :func:`eval` and :func:`exec` is a code block.
ru: :dfn:`Блок` - часть текста программы на Питоне, которая выполняется как одно целое. Блоками является следующее : модуль, тело функции и определение класса. Каждая команда, набранная интерактивно, является блоком. Файл скрипта (файл, заданный как стандартный ввод интерпретатора или указанный в первом аргументе командной строки интерпретатора) является блоком кода. Команда скрипта (команда указанная с опцией '**-c**' в командной строке интерпретатора) является блоком кода. Текстовый аргумент переданный встроенным функциям «:func:`eval`» и «:func:`exec`» тоже является блоком кода.

source: A code block is executed in an :dfn:`execution frame`. A frame contains some administrative information (used for debugging) and determines where and how execution continues after the code block's execution has completed.
ru: Блок кода выполняется в :dfn:`кадре исполнения`. Кадр содержит административную информацию (использующуюся для отладки), и определяет, где и как продолжается выполнение после завершения выполнения блока кода.

source: A :dfn:`scope` defines the visibility of a name within a block. If a local variable is defined in a block, its scope includes that block. If the definition occurs in a function block, the scope extends to any blocks contained within the defining one, unless a contained block introduces a different binding for the name. The scope of names defined in a class block is limited to the class block; it does not extend to the code blocks of methods -- this includes comprehensions and generator expressions since they are implemented using a function scope. This means that the following will fail::
ru: «:dfn:`Область видимости`» определяет видимость имени внутри блока. Если локальная переменная определена в блоке, то ее область видимости включает этот блок. Если это определение происходит в блоке функции, то ее область видимости распространяется на любые блоки, содержащиеся в данном, если только содержащийся блок не вводит своё назначение данному имени. Область видимости имён, определенных в блоке класса ограничивается этим блоком класса; но она не распространяется на блоки кода методов - включая comprehensions и выражения генераторов, поскольку они реализованы с помощью функций (которые создают свою область видимости). Это означает, что следующее приведёт к ошибке :

source: When a name is used in a code block, it is resolved using the nearest enclosing scope. The set of all such scopes visible to a code block is called the block's :dfn:`environment`.
ru: Если имя упоминается в блоке кода, то его значение ищется последовательно переходя от данной области видимости к следующей непосредственно объемлющей её – и так далее – до первой содержащей определение данного имени. Множество всех таких областей видимости, используемых блоком кода - называется :dfn:`окружением` данного блока.

source: If a name is bound in a block, it is a local variable of that block, unless declared as :keyword:`nonlocal`. If a name is bound at the module level, it is a global variable. (The variables of the module code block are local and global.) If a variable is used in a code block but not defined there, it is a :dfn:`free variable`.
ru: Если имя было назначено в блоке , то оно является локальной переменной этого блока, если не объявлено явно как не локальное – :keyword:`nonlocal` . Если имя назначено на уровне модуля - оно является глобальной переменной. (Переменные в блоке кода модуля являются с разных точек зрения и локальными и глобальными.) Если переменная используется в блоке кода но не определена непосредственно в нём (но определена в окружении), то она является “:dfn:`свободной переменной`” .
